//  Last Modify: 2017/02/04 21:10
/*	==================================================
	Include Class:	SkillName (it's a public class)
	==================================================*/
function SkillName(){
}
SkillName.arr = [];

//==============================
// ** Public Function
//==============================
// :: get DF-ShonobiGami system skill name array
	SkillName.getShonobiGamiArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("器術","絡繰術", "火術", "水術", "針術", "藏兵術", "衣裝術", "繩術", "登術", "拷問術", "壞器術", "掘削術");
		arr[1] = new Array("體術","騎乘術", "砲術", "手裏劍術", "手練", "身體操術", "步法", "走法", "飛術", "骨法術", "刀術", "怪力");
		arr[2] = new Array("忍術","生存術", "潛伏術", "遁走術", "盜聽術", "腹語術", "隱形術", "變裝術", "香術", "分身術", "隱蔽術", "第六感");
		arr[3] = new Array("謀術","醫術", "毒術", "陷阱術", "調查術", "詐術", "對人術", "遊藝", "色誘術", "傀儡術", "流言術", "經濟力");
		arr[4] = new Array("戰術","兵糧術", "鳥獸術", "野戰術", "地利", "意氣", "用兵術", "記憶術", "見敵術", "暗號術", "傳達術", "人脈");
		arr[5] = new Array("妖術","異形化","召喚術","死靈術","結界術","封術","言靈術","幻術","瞳術","千里眼","憑依術","呪術");
		
		SkillName.arr = arr;
	}
// :: get DF-MagicaLogia system skill name array
	SkillName.getMagicaLogiaArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("星","黃金","大地","森","道路","海","寂靜","雨","嵐","太陽","天空","異界");
		arr[1] = new Array("獸","肉","蟲","花","血","鱗","混沌","牙","喊叫","憤怒","翼","情色");
		arr[2] = new Array("力","重力","風","流動","水","波","自由","衝擊","雷","炎","光","圓環");
		arr[3] = new Array("歌","物語","旋律","淚","別離","微笑","思念","勝利","戀","熱情","療癒","時間");
		arr[4] = new Array("夢","追憶","謎","說謊","不安","睡眠","偶然","幻","狂氣","祈禱","希望","未來");
		arr[5] = new Array("闇","深淵","腐敗","背叛","迷失","怠惰","歪曲","不幸","愚笨","惡意","絕望","死");
		
		SkillName.arr = arr;
	}
// :: get DF-Insane system skill name array
	SkillName.getInsaneArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("暴力","焚燒","拷問","緊縛","威脅","破壞","毆打","切斬","刺擊","射擊","戰爭","埋葬");
		arr[1] = new Array("情動","戀","喜悅","憂傷","羞恥","笑","忍耐","驚訝","憤怒","恨","悲哀","愛");
		arr[2] = new Array("知覺","疼痛","官能","觸覺","嗅覺","味覺","聽覺","情景","追蹤","藝術","第六感","隱蔽");
		arr[3] = new Array("技術","分解","電子","整理","藥品","效率","多媒體","攝影","駕駛","機械","陷阱","兵器");
		arr[4] = new Array("知識","物理學","數學","化學","生物學","醫學","教養","人類學","歷史","民俗學","考古學","天文學");
		arr[5] = new Array("怪異","時間","混沌","深海","死","靈魂","魔術","暗黑","終末","夢","地底","宇宙");
		
		SkillName.arr = arr;
	}
// :: get DF-BloodCrusade system skill name array
	SkillName.getBloodCrusadeArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("社會","膽怯","威脅","不思考","自信","沉默","傳達","詐騙","地位","笑","說話","憤怒");
		arr[1] = new Array("頭部","聽聞","感覺器","瞧見","反應","思考","腦","靈光一閃","預感","喊叫","口","噬咬");
		arr[2] = new Array("腕部","勒緊","毆打","斬","慣用手","射擊","操作","刺","非慣用手","揮動","抓","投擲");
		arr[3] = new Array("身體","堵塞","呼吸器","阻止","承受","量測","心臟","閃躲","格擋","忍耐","消化器","墜落");
		arr[4] = new Array("腳步","奔跑","逼近","踢","慣用腳","跳","啟動","踩踏","非慣用腳","爬行","臥倒","行走");
		arr[5] = new Array("環境","休息","日常","隱藏","等待","出現","人脈","捕捉","開啟","逃跑","退路","不休");
		
		SkillName.arr = arr;
	}
// :: get DF-CardRanker system skill name array
	SkillName.getCardRankerArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("白","白龍","僧侶","格鬥家","斧頭使","劍士","槍兵","步兵","弓兵","砲兵","天使","軍神");
		arr[1] = new Array("藍","水龍","魚","魚人","烏賊","螃蟹","偵探","海賊","魔術師","使魔","雲","水精靈");
		arr[2] = new Array("綠","綠龍","蠕蟲","鳥人","鳥","獸","獸人","精靈","妖精","昆蟲","植物","森精靈");
		arr[3] = new Array("金","金龍","寶石","岩石","鋼","鍊金術師","魔法生物","矮人","機械","命運","女神","土精靈");
		arr[4] = new Array("紅","火龍","龍人","恐龍","戰車","蠻族","小鬼","大鬼","巨人","雷","炎","火精靈");
		arr[5] = new Array("黑","黑龍","闇騎士","怪物","忍者","妖怪","蝙蝠","吸血鬼","不死者","幽靈","惡魔","邪神");
		
		SkillName.arr = arr;
	}
// :: get DF-KillDeathBusiness system skill name array
	SkillName.getKillDeathBusinessArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("職業","無業","藝術家","研究者","家事幫手","學生","惡棍","勞動者","偵探","大人物","醫師","公務員");
		arr[1] = new Array("動作","喊叫","閃現","斬","揮動","投擲","毆打","踢","跳","射擊","抓","等待");
		arr[2] = new Array("小道具","耳環","髮飾","槍","項鍊","腰帶","眼鏡","帽子","鐘錶","劍","戒指","刺青");
		arr[3] = new Array("衣裝","裸體","戶外風","民族風","嘻哈風","軍裝系","正裝","傳統風","歌德風","龐克風","重金屬風","偶像風");
		arr[4] = new Array("情動","愛","喜悅","期待","焦躁","自負","憤怒","悲哀","忌妒","恐懼","羞恥","嫌惡");
		arr[5] = new Array("願望","死","復仇","勝利","支配","獲得","繁榮","強化","安全","健康","長壽","生");
		
		SkillName.arr = arr;
	}
// :: get DF-KantaiCollection system skill name array
	SkillName.getKanColleArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("背景","人脈","名聲","灰暗過去","古風","口癖","幸運","偶像","秘密武器","大小姐","容姿","海外生活");
		arr[1] = new Array("魅力","坦率","冷酷","溫柔","賢淑","堅強","笑容","笨蛋","爽朗","有趣","Ｈ","華麗");
		arr[2] = new Array("性格","不可思議","大方","照顧人","認真","不服輸","活潑","樂觀","細心","壞心眼","自由奔放","大膽");
		arr[3] = new Array("興趣","睡覺","幻想","生物","閱讀","食物","八卦","購物","藝能","時尚","入浴","戀愛");
		arr[4] = new Array("航海","暗號","通信","索敵","規律","補給","待機","機動","航海圖","指揮","衛生","整備");
		arr[5] = new Array("戰鬥","電子戰","航空打擊戰","航空戰","對空戰鬥","突擊","砲擊","撤退","支援","魚雷","對潛戰鬥","夜戰");
		
		SkillName.arr = arr;
	}
// :: get DF-Yankee&Yog-Sothoth system skill name array
	SkillName.getBodgieAndYogArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("苦手","大人","讀書","敗北","昆蟲","家長","異性","孤獨","高處","黑暗","恐怖","小孩");
		arr[1] = new Array("社團","柔道","職業摔角","跆拳道","空手道","拳擊","回家","劍道","棒球","應援團","科學","文系");
		arr[2] = new Array("中學","壞小子","統一","打工","學藝","打架","逃課","認真","玩耍","模仿","社團活動","什麼也沒做");
		arr[3] = new Array("興趣","好色","汽機車","家事","料理","運動","修行","時裝","結伴同行","睡覺","遊戲","讀書");
		arr[4] = new Array("風格","適當","笨蛋","強勢","熱血","硬派","自然","軟派","最愛自己","腹黑","冷靜","知識分子");
		arr[5] = new Array("喜好","悠哉","飲食","逆轉","家人","支配","受讚美","戀愛","友情","勝利","金錢","寂靜");
		
		SkillName.arr = arr;
	}
// :: get DF-Lost~Ruin&Forest&Children~ system skill name array
	SkillName.getLOSTArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("技術","追蹤","探索","鑑定","治療","雜學","機械","製作","科學","料理","傳達","歌唱");
		arr[1] = new Array("頭部","聆聽","感覺器官","瞧見","反應","靈光一閃","腦部","思考","預感","喊叫","口部","噬咬");
		arr[2] = new Array("腕部","操作","毆打","切斬","慣用手","射擊","抓握","投擲","非慣用手","刺擊","揮動","勒緊");
		arr[3] = new Array("身體","堵塞","呼吸器官","阻止","不動","承受","心臟","閃躲","格擋","墜落","消化器官","忍耐");
		arr[4] = new Array("腳步","游泳","奔跑","踢擊","慣用腳","跳躍","纖手","蹲下","非慣用腳","滑行","踩踏","行走");
		arr[5] = new Array("環境","地理","不休","等待","捕捉","隱藏","休息","平衡","出現","追趕","逃跑","陷阱");
		
		SkillName.arr = arr;
	}
// :: get DF-Majoshukaideaimasho~ system skill name array
	SkillName.getWitchArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("雜務","打掃","洗衣","沐浴","鋪床","加熱","料理","妝點","著裝","採購","對話","書信");
		arr[1] = new Array("知識","衛生學","藥草學","熱力學","醫學","地質學","營養學","民俗學","藝術學","經濟學","心理學","軍事學");
		arr[2] = new Array("自然","光","植物","炎","治癒","大地","生命","肉體","風","水","精神","闇");
		arr[3] = new Array("慾望","榮譽","繁衍","破壞","睡眠","庇護","愛情","鍛鍊","解放","自由","痛苦","憎惡");
		arr[4] = new Array("戰鬥","宣名","挑釁","打擊","回復","防禦","保護","蓄力","斬擊","射擊","拷問","殺傷");
		arr[5] = new Array("不幸","詛咒","嘲弄","罪業","惡意","疑心","依存","怨恨","傷痕","盲目","欠落","死穢");
		
		SkillName.arr = arr;
	}
// :: get DF-GapOjisan system skill name array
	SkillName.getOchisanArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("組織","叛徒","間諜","權力","國家","護衛","裝備","替身","人員","部隊","菁英","勸誘");
		arr[1] = new Array("技術","藏匿","竊聽","虛偽","調度","擬態","躲藏","掩護","陷阱","誘導","狙擊","破壞");
		arr[2] = new Array("武藝","騎乘","眼神","聽音","心理","解讀","身法","無刀","肉搏","投擲","揮舞","切斷");
		arr[3] = new Array("魔術","預知","交感","感染","通靈術","憑依","防壁","召喚","命令","力場","光彈","天候");
		arr[4] = new Array("肉體","超感覺","超視覺","超夜視","超聽覺","超軟體","超剛體","超腿力","超握力","超腕力","超反射","超回復");
		arr[5] = new Array("怪物","幽體","複眼","超音波","變色","表皮","鱗片","翼","觸手","爪","牙","不死");
		
		SkillName.arr = arr;
	}