//  Last Modify: 2015/01/17 23:52
/*	==================================================
	Include Class:	SkillName (it's a public class)
	==================================================*/
function SkillName(){
}

//==============================
// ** Public Function
//==============================
// :: get DF-ShonobiGami system skill name array
	SkillName.getShonobiGamiArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("器術","絡繰術", "火術", "水術", "針術", "藏兵術", "衣裝術", "繩術", "登術", "拷問術", "壞器術", "掘削術");
		arr[1] = new Array("體術","騎乘術", "砲術", "手裏劍術", "手練", "身體操術", "步法", "走法", "飛術", "骨法術", "刀術", "怪力");
		arr[2] = new Array("忍術","生存術", "潛伏術", "遁走術", "盜聽術", "腹語術", "隱形術", "變裝術", "香術", "分身術", "隱蔽術", "第六感");
		arr[3] = new Array("謀術","醫術", "毒術", "陷阱術", "調查術", "詐術", "對人術", "遊藝", "色誘術", "傀儡術", "流言術", "經濟力");
		arr[4] = new Array("戰術","兵糧術", "鳥獸術", "野戰術", "地利", "意氣", "用兵術", "記憶術", "見敵術", "暗號術", "傳達術", "人脈");
		arr[5] = new Array("妖術","異形化","召喚術","死靈術","結界術","封術","言靈術","幻術","瞳術","千里眼","憑依術","呪術");
		
		return arr;
	}
// :: get DF-MagicaLogia system skill name array
	SkillName.getMagicaLogiaArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("星","黃金","大地","森","道路","海","寂靜","雨","嵐","太陽","天空","異界");
		arr[1] = new Array("獸","肉","蟲","花","血","鱗","混沌","牙","喊叫","憤怒","翼","情色");
		arr[2] = new Array("力","重力","風","流動","水","波","自由","衝擊","雷","炎","光","圓環");
		arr[3] = new Array("歌","物語","旋律","淚","別離","微笑","思念","勝利","戀","熱情","療癒","時間");
		arr[4] = new Array("夢","追憶","謎","說謊","不安","睡眠","偶然","幻","狂氣","祈禱","希望","未來");
		arr[5] = new Array("闇","深淵","腐敗","背叛","迷失","怠惰","歪曲","不幸","愚笨","惡意","絕望","死");
		
		return arr;
	}
// :: get DF-Insane system skill name array
	SkillName.getInsaneArray = function(){
		var arr = new Array(6);
		arr[0] = new Array("暴力","焚燒","拷問","緊縛","威脅","破壞","毆打","切斬","刺擊","射擊","戰爭","埋葬");
		arr[1] = new Array("情動","戀","喜悅","憂傷","羞恥","笑","忍耐","驚訝","憤怒","恨","悲哀","愛");
		arr[2] = new Array("知覺","疼痛","官能","觸覺","嗅覺","味覺","聽覺","情景","追蹤","藝術","第六感","隱蔽");
		arr[3] = new Array("技術","分解","電子","整理","藥品","效率","多媒體","攝影","駕駛","機械","陷阱","兵器");
		arr[4] = new Array("知識","物理學","數學","化學","生物學","醫學","教養","人類學","歷史","民俗學","考古學","天文學");
		arr[5] = new Array("怪異","時間","混沌","深海","死","靈魂","魔術","暗黑","終末","夢","地底","宇宙");
		
		return arr;
	}
