//===============================
//角色資訊 文本
//===============================
var CharInfo = Array();
//=============黑木 楓============
CharInfo[0] = Array();
CharInfo[0][0] = ["黑木 楓","人物",0,"圖片位置"];
CharInfo[0][1] = "４５歲的中年婦女，黑木一夫的妻子。對於最近先生失蹤的情況感到不安，但仍堅強的維持著家庭生計。";
CharInfo[0][2] = Array();
CharInfo[0][3] = 1; //秘密是否開啟
CharInfo[0][4] = "曾與先生一同建起了那座小廟，埋下樹苗，冀望町中的和平。"
				+"<br>但……曾幾何時，不幸卻接二連三……"
				+"<p>……老公，你現在……還平安嗎？";
CharInfo[0][5] = Array();
	CharInfo[0][5][0] = "公開此秘密後，公開「廟旁的杉樹」的角色卡";
	CharInfo[0][5][1] = "公開此秘密者，對此角色的運命點數＋１，屬性「尊敬」";
CharInfo[0][6] = 0; //魔法相關：0無關、1斷章、2魔法使

//=============黑木 奈緒子============
CharInfo[1] = Array();
CharInfo[1][0] = ["黑木 奈緒子","人物",0,"圖片位置"];
CharInfo[1][1] = "１６歲少女，黑木一夫的女兒。由於出生的較晚，很受父母的寵愛。在母親的薰陶下，懂得溫和的待人接物。但也時不時會表現出堅持不退讓的一面。相當尊敬父親。";
CharInfo[1][2] = Array();
CharInfo[1][3] = 1; //秘密是否開啟
CharInfo[1][4] = "我討厭青柳那個惡劣的渾蛋！"
				+"<p>爸爸明明就沒有做錯事，為什麼一定要那樣汙衊爸爸的名聲！"
				+"<br>現在爸爸失蹤、村子又發生那麼多事，肯定都是他一手策畫的！";
CharInfo[1][5] = Array();
	CharInfo[1][5][0] = "公開此秘密者，對此角色的運命點數＋１，屬性隨機";
CharInfo[1][6] = 0; //魔法相關：0無關、1斷章、2魔法使

//=============小幡 和代============
CharInfo[2] = Array();
CharInfo[2][0] = ["小幡 和代","人物",0,"圖片位置"];
CharInfo[2][1] = "２８歲的女強人，現任町長。做事強硬，情緒強烈且直性子，對於決策很有一套。雖然不甚親民，但功績頗受當地居民好評。";
CharInfo[2][2] = Array();
CharInfo[2][3] = 1; //秘密是否開啟
CharInfo[2][4] = "莫名其妙，最近町中意外頻頻發生。一件兩件就算了，最近這發生的頻率……難道是誰的惡作劇？"
				+"<p>－－令人煩躁，町裡的大家的情緒因此低落。絕對要找出這些意外的原因！";
CharInfo[2][5] = Array();
	CharInfo[2][5][0] = "公開此秘密者，對此角色的運命點數＋１，屬性隨機。";
	CharInfo[2][5][1] = "此角色若在「插曲」中遭受運命變轉，會因此而死亡。";
CharInfo[2][6] = 0; //魔法相關：0無關、1斷章、2魔法使

//=============青柳 大翔============
CharInfo[3] = Array();
CharInfo[3][0] = ["青柳 大翔","人物",0,"圖片位置"];
CharInfo[3][1] = "２８歲青年，帶著眼鏡，一臉正經。町長的左右手，最近才開始嶄露頭角。抱有強大的企圖心。";
CharInfo[3][2] = Array();
CharInfo[3][3] = 1; //秘密是否開啟
CharInfo[3][4] = "曾經在黑木 一夫的旗下打理行政，也因此接觸到黑木 一夫的醜聞。在引爆醜聞後跳槽到村長手下工作，成為其行政助手。"
				+"<p>然而－－還不夠，還不夠，這點地位……"
				+"<br>還要更加、更加、更加強大起來！";
CharInfo[3][5] = Array();
	CharInfo[3][5][0] = "每一巡迴結束後，憑依深度＋１。";
CharInfo[3][6] = 1; //魔法相關：0無關、1斷章、2魔法使
CharInfo[3][7] = ["斷章憑依",["斷章《茁壯》","魔法名"],"8","四","三","五","四","1","",""];
CharInfo[3][8] = ["星",["太陽"]];
CharInfo[3][9] = ["逆轉：太陽","書影","逃亡"];

//=============張千葉============
CharInfo[4] = Array();
CharInfo[4][0] = ["張千葉","人物",0,"圖片位置"];
CharInfo[4][1] = "２０歲男性，來自中國的留學生。附近大學的學生，為了通識課的作業而來到村中進行訪查。雖說動機如此，但實際上對調查不甚熱衷。常能看到他在村中打混閒聊的身影。";
CharInfo[4][2] = Array();
CharInfo[4][3] = 1; //秘密是否開啟
CharInfo[4][4] = "帶著到此一遊的心態，書籍卿「少年Ｋ」以享樂的心態，觀察著町中的惡意。雖然不是始作俑者，但「少年Ｋ」永遠不介意在這團災難中添亂"
				+"<p>「啊，被大法典的傢伙發現了啊……嘿嘿，如何？想阻止我們嗎？」";
CharInfo[4][5] = Array();
	CharInfo[4][5][0] = "公開此秘密者，進行《肉》的特技判定，成功則獲得２點獸魔素，失敗則減少１魔力。";
	CharInfo[4][5][1] = "若至高潮之戰前沒有擊敗「少年Ｋ」，則少年Ｋ會在高潮之戰後隨機對單一玩家宣戰。";
	CharInfo[4][5][2] = "「插曲」時，若此角色的秘密已公開，可以對此角色宣戰";
	CharInfo[4][5][3] = "此角色持有與此劇本無關之斷章《一千零一夜》";
CharInfo[4][6] = 2; //魔法相關：0無關、1斷章、2魔法使
CharInfo[4][7] = ["書籍卿",["少年Ｋ","《食屍鬼之口》"],"9","三","三","三","三","憑依深度","異型之魔動","《攻擊強化》麥加的食屍鬼之血"];
CharInfo[4][8] = ["闇",["嵐","肉","衝擊","迷失","絕望"]];
CharInfo[4][9] = ["緊急召喚","騎士召喚：絕望","咒砲","再生","觸手","異言"];
CharInfo[4][10] = 1;
CharInfo[4][11] = ["",["斷章《一千零一夜》",""],"3","三","三","三","三","持有","",""];
CharInfo[4][12] = ["歌",["物語"]];
CharInfo[4][13] = ["精靈召喚：物語","軍團召喚：物語"];

//=============廟旁的杉樹============
CharInfo[5] = Array();
CharInfo[5][0] = ["廟旁的杉樹","地點",0,"圖片位置"];
CharInfo[5][1] = "小廟旁佇立著的杉樹，樹寬約三人合抱，雖然樹上纏著注連繩，但似乎不被當地民眾敬畏，甚至可說是默默無名。沒有稱謂，沒有崇拜，似乎就只是一顆普通的杉木。";
CharInfo[5][2] = Array();
	CharInfo[5][2][0] = "指定此角色出場時，若場景不為２，３，５，７，９，１１，１２，則場景指定為７。";
CharInfo[5][3] = 1; //秘密是否開啟
CharInfo[5][4] = "即使無人崇拜，樹齡超過一百的杉木早已擁有了靈性。"
				+"<p>……曾經，曾經有過一個人，為自己纏上了注連繩，對著自己雙手合掌，輕輕許下了願望……"
				+"<br>我……一直想回應那個願望。";
CharInfo[5][5] = Array();
	CharInfo[5][5][0] = "剝除其斷章後，公開「黑木 一夫」的角色卡";
CharInfo[5][6] = 1; //魔法相關：0無關、1斷章、2魔法使
CharInfo[5][7] = ["斷章憑依",["斷章《魔樹》","魔法名"],"9","四","五","三","四","2","",""];
CharInfo[5][8] = ["星",["森"]];
CharInfo[5][9] = ["乙女召喚：森","魔王召喚：森","難書"];

//=============黑木 一夫============
CharInfo[6] = Array();
CharInfo[6][0] = ["黑木 一夫","人物",0,"圖片位置"];
CharInfo[6][1] = "５６歲的男子，曾經是村中頗有威望的人物，但在遭到青柳 大翔的惡意中傷後，地位就此一落千丈，不久後失蹤。"
				+"<br>被困在廟旁杉木中的異空間中，靠著斷章提供魔力而苟活，意識不清。";
CharInfo[6][2] = Array();
	CharInfo[6][2][0] = "指定此角色出場時，若場景不為２，３，５，７，９，１１，１２，則場景指定為７。";
CharInfo[6][3] = 1; //秘密是否開啟
CharInfo[6][4] = "殺……饒不了那個混帳……"
				+"<br>為什、麼……會那麼憤怒……一定要報復……"
				+"<p>不只、不只，這股「惡意」。"
				+"<br>我要將惡意，散播出去‥‥整個村莊、整個國家……";
CharInfo[6][5] = Array();
	CharInfo[6][5][0] = "當此卡成為探秘密的對象時，將探秘密的行動視作宣戰。	";
	CharInfo[6][5][1] = "當此卡成為探秘密的對象時，無須判定，直接公開此角色卡。";
CharInfo[6][6] = 1; //魔法相關：0無關、1斷章、2魔法使
CharInfo[6][7] = ["斷章憑依",["斷章《惡意》","魔法名"],"7","四","四","四","四","4","",""];
CharInfo[6][8] = ["闇",["惡意"]];
CharInfo[6][9] = ["陷阱","感染","隔離"];

/*

//=============NPC============
CharInfo[0] = Array();
CharInfo[0][0] = ["名稱","類型",0,"圖片位置"];
CharInfo[0][1] = "描述";
CharInfo[0][2] = Array();
	CharInfo[0][2][0] = "描述備註1";
	CharInfo[0][2][1] = "描述備註2";
CharInfo[0][3] = 1; //秘密是否開啟
CharInfo[0][4] = "秘密描述";
CharInfo[0][5] = Array();
	CharInfo[0][5][0] = "秘密備註1";
	CharInfo[0][5][1] = "秘密備註2";
CharInfo[0][6] = 1; //魔法相關：0無關、1斷章、2魔法使
CharInfo[0][7] = ["類型",["真名","魔法名"],"魔力","階梯","攻擊","防禦","根源","憑依深度","魂特","真姿"];
CharInfo[0][8] = ["力",["衝擊","特技","特技"]];
CharInfo[0][9] = ["藏書","藏書","藏書"];

*/