//===============================
//角色資訊 文本
//===============================
var CharInfo = Array(4);
//=============阿瑞斯============
CharInfo[0] = Array();
CharInfo[0][0] = ["阿瑞斯．弗德","古戰場的掌旗官","薩托里","a88d2e",1];
CharInfo[0][1] = ["男","142歲","三","四","三","三"];
CharInfo[0][2] = ["書警","圓桌","力","凱旋號角","《魔力解放》瓦爾哈啦之扉"];
CharInfo[0][3] = ["喊叫","流動","光","勝利","深淵"];
CharInfo[0][4] = ["緊急召喚","魔劍召喚：勝利","拒絕","攻則","後援","裁火"];
CharInfo[0][5] = Array();
	CharInfo[0][5][0] = ["古利安","3","老友","德國高階軍官，知道魔法的存在，是目前德國對裡側事務的負責人。"];
CharInfo[0][6] = "德國高階將領，35歲的少將。";
CharInfo[0][7] = "黑髮黑眼，穿著德國制式軍裝。";
CharInfo[0][8] = "隨和，不太會拒絕別人的青年，看起來很好說話，實際上也是，只要不要太奇怪的要求都會答應。<br>武力主義者，奉行能用武力就用武力解決的信條。";
CharInfo[0][9] = "阿瑞斯原本並沒有名字，他出生的目的，就是作為『影子』而存在的，身為德意志帝國所培養的『替身』中的一員，從出生開始，他就被灌輸了對國家絕對忠誠的思想，對他來說，這便是絕對的一切。"
　　　　		+"<p>這樣的他，一直作為鐵血宰相俾斯麥的『影』而活著，代替這位鐵血宰相擋住了無數次的暗殺和迫害，他原本以為，自己將會一直作為影子而活下去，但這一切，就在俾斯麥死亡之後全都改變了。"
　　　　		+"<p>失去了光的影子，便失去了生存的意義，感到無所適從的他，完全失去了生活的意義，正打算隨著光離去的影子，突然發現自己的身體出現了奇特的變化，與此同時一位自稱《大法典》魔法使的男人也出現在他的眼前，將他帶入了世界的裏側。"
　　　　		+"<p>於是，失去生存意義的他，在魔法使的勸說下，為了尋找新的光芒，進入了學院，重新認識這個世界，最後，他發現，原來所謂的光芒，其實只是自己思想上的投射，意識到這點的他，將自己的對於光的依賴，投射到大法典的工作之上，並以戰神阿瑞斯為名，以紀念自己曾經的光。從學院畢業之後，他被延攬進入圓桌，並在德國支部擔任要職。"
　　　　		+"<p>在擔任魔法使的同時，作為這個國家的影子，在暗處守護著這個國家，或許在內心深處，對於國家的忠誠心仍尚未消失吧。";

//=============塚本 野乃香============
CharInfo[1] = Array();
CharInfo[1][0] = ["塚本 野乃香","常夜的魂禊人","Artis","5fa233",1];
CharInfo[1][1] = ["女","203歲","三","三","三","三"];
CharInfo[1][2] = ["司書","戶口","獸","荒神鎮壓裝束","《魔力解放》除穢之水"];
CharInfo[1][3] = ["雨","鱗","憤怒","勝利","不安"];
CharInfo[1][4] = ["緊急召喚","乙女召喚：鱗","龍鱗","裁斷","分析","秘鍵"];
CharInfo[1][5] = Array();
	CharInfo[1][5][0] = ["海老 円","3","同好","73歲的單身老者，退役軍人，因為和野乃香同樣是喜歡茶葉的同好所以經常到茶店光顧。"];
CharInfo[1][6] = "外表28歲，茶葉店老闆。";
CharInfo[1][7] = "眼睛微瞇、穿著素色和服(褐色)的女子，頭髮紮成傳統女性的包包頭，不知為何總是穿著圍巾和手套。";
CharInfo[1][8] = "有著在懷中暗藏短竹刀的習慣、講話總是有氣無力、行動一向謹慎，不過和他熟識的人能看到她喜歡研究茶葉的一面，和平主義者一名，除非真得必要不然連對上書籍卿也不太在意。";
CharInfo[1][9] = "退魔世家塚本家第十八代的長女，以狩獵荒神(月獸)為天職的獵人。因為基於使命感，除了狩獵和繁延後代之外的事情都不感興趣。"
				+"其中她為了能夠得到讓狩獵更方便的力量，她以荒神的骨為兵、肉為食，不斷強化自己的肉身。不過這份執著也讓她嘗到了苦果，隨著不斷食用荒神的血肉獲得力量的同時，她的身體也變得越來越像荒神，當她發覺這個問題時已經太晚了。"
				+"野乃香身體開始荒神化而不得不哀求族人將她殺害，在她闔上眼準備迎接死期時，突然山洪暴發，她試著伸手保護族人卻只能眼睜睜的看著其他人被土石淹沒，自己也失去了意識。"
　　　　		+"<p>等她回復意識時，她已經在一個小房間內，過不久，有一個自稱是魔法使的人找了她會談，從那魔法使口中得知那山洪暴發是因為自己的身體和附近的斷章產生共鳴所導致的魔法災厄，當野乃香聽到這消息時，她在悲憤交加之下差點自戕"
　　　　		+"<p>「在妳自殺之前問妳一個問題吧？妳是想要自殺讓妳的族人死得不明不白，還是加入我們好避免這種狀況再度發生？」 "
				+"野乃香因為魔法使的這句話而放棄輕生並加入了<大法典>(在塚本家被當作戰死)。在現代，經過專業魔法使訓練的她駐紮在千葉戶口支部，在處理業務的同時默默的守護著塚本家";

//=============柿本一道============
CharInfo[2] = Array();
CharInfo[2][0] = ["柿本 一道","群青魔紋使","藍刺蝟","0932f4",1];
CharInfo[2][1] = ["男","19歲","三","三","三","三"];
CharInfo[2][2] = ["訪問者","學院","星","持有獸．深淵巨口","《魔法覺醒》精武時万"];
CharInfo[2][3] = ["森","嵐","憤怒","微笑","希望"];
CharInfo[2][4] = ["緊急召喚","魔劍召喚：嵐","龍卷","衝動","導師：希望","幸運"];
CharInfo[2][5] = Array();
	CharInfo[2][5][0] = ["Sasa","1","同好","斜齒忍軍的忍者，與一道同年。短髮、戴著笠帽，並用黑布遮著下半臉，常被認為是男性。但其實是女性。家族世代都具有魔法才能，因此被父親送來學院學習，但Sasa並不想學習魔法，她要證明忍術也可以與魔法並駕齊驅。這應該不是偷懶不學習的藉口。擅長奈落和埋火。和一道喜歡同一部漫畫。"];
	CharInfo[2][5][1] = ["前間田野","3","老友","小學一直到高中、大學，都就讀同一所學校的好朋友（男性）。戴眼鏡，喜歡講些不冷的冷笑話。最近因為一道在「學院」太忙，無暇顧及凡人社會的關係，兩人的往來變得較少。"];
CharInfo[2][6] = "大學一年生，現正無限期休學中。";
CharInfo[2][7] = "升上大學後開始留長頭髮，一頭鳥巢白天很猖狂、夜晚收斂些。"
　　　　		+"<br>對衣著不太在意，能保暖就好了。經過修行鍛鍊的身體，雖然看似瘦弱，但運動能力優秀。";
CharInfo[2][8] = "兩年了，還是不能適應自己的新身分，再加上魔紋的修鍊也遇到瓶頸，最近正處於煩躁期。考慮到以後可能還要當幾百年的魔法使，一道暫時停止凡人的學業，將大部份心思放在魔法使的學院裡。但是，「成為魔法使後，才知道世界上怪人這麼多。」常常跟朋友這樣抱怨著，只有幾十歲、思想仍接近普通人的一道很難與上百歲的老妖們相處。"
　　　			+"<p>極度厭惡對凡人施放魔法，就算是善意也盡量避免，「不要因為方便，就隨便將普通人捲進魔法裡啊混蛋！」。對某些魔法使的高傲態度不以為然，也從不稱呼普通人為「愚者」。"
　　　			+"<p>喜歡的東西是冰品，尤其是銼冰，其中又以清冰為上。討厭的東西是溫泉。";
CharInfo[2][9] = "柿本一道的超能力在十三歲時覺醒。常有奇異的生物從他身上冒出來，偶爾能讓物體漂浮，甚至讀取別人思想。這些能力在日常生活中非常多餘，一道為此痛苦不堪。"
　　　			+"<br>高二那年，因緣際會下結識了戶口的魔法使。託她的福，找到方法暫時抑制「超能力」，也在她的介紹下進入學院就讀。據說一道的超能與一種稱為「魔紋」的魔法很像，於是安排一道接受魔紋導師、赤澄魔紋使索依亞．羅蘭的特別指導。實際上索依亞的學生也只有他一個而已，因此師生關係特別優良。魔紋使向來以顏色為魔法名，一道得到「群青魔紋使」的稱號。"
		　　　	+"<p>教學中，索依亞發現一道的魔紋是在早期研究中曾一度被淘汰的種類。在五十年前的阿房宮，魔紋研究方向曾出現分歧，「魔素派」以強化吸收外界魔素為主，尋求穩健提生實力的路線，「持有派」則主張將神魔妖怪收養體內，外界取得的魔素做養料供奉並交換力量，能在短時間得到爆炸性成長。由於後者不是真正的「契約關係」，當養料不足時，體內飼養的異物可能會反嗜魔紋使肉體，危險性過大，因此支持者越來越少。最後一名持有派的支持者憤而銷毀自己的研究成果，離開阿房宮。雖然難以相信，但一道的體內住著邪靈「捌咫鱗龍」，這是持有派特有的修練方法。索依亞拿出修道服「精武時万」贈予一道，囑咐他盡量使用魔素派的魔紋，如果遇上必定得使用持有派力量的情況，一定要穿上這件精武時万。"
　　　			+"<br>因為與魔紋相關的特殊性質，一道沒有進入一般學院生的宿舍。他來到「花墓園」，原本是古老的墓穴，改建成供學生居住的宿舍，成員都是必須接受特殊指導的學生，平日也進行著以加強實戰能力為目標的集訓。一人分配一間寢室，男女沒有特別分隔。大部分的課程會在宿舍附近進行，一道主要的朋友群也都在宿舍。"
　　　			+"<br>魔法使的外貌通常不會隨年齡變化，但一道的外表仍像常人一樣改變。也許是因為他還不完全相信自己是魔法使吧。";

//=============芙蕾雅============
CharInfo[3] = Array();
CharInfo[3][0] = ["芙蕾雅．華納．舒爾茨","女武神巴薩卡","Mr.天狼星","da4444",1];
CharInfo[3][1] = ["女","1112歲","三","三","三","三"];
CharInfo[3][2] = ["異端者","無","獸","狂戰士之魂","《攻擊強化》挪威雌獅的咆哮"];
CharInfo[3][3] = ["血","憤怒","勝利","狂氣","死"];
CharInfo[3][4] = ["緊急召喚","魔劍召喚：狂氣","軍團召喚：勝利","武勇","吸精","鉤爪"];
CharInfo[3][5] = Array();
	CharInfo[3][5][0] = ["阿德萊德","3","庇護","25歲的德國留學生，無神論者，在酒吧拚酒時認識，芙蕾雅正想辦法讓他信仰戰神奧丁，令他能在死後被自己選入英靈殿。"];
CharInfo[3][6] = "挪威伐木場場主。";
CharInfo[3][7] = "黑髮碧眼的豪爽女子，長髮披散、不加束縛，身穿褐色長衣、吊帶牛仔褲、牛皮長靴，口袋裡有一雙鐵手套。";
CharInfo[3][8] = "豪邁奔放、爽朗不羈，嗜食豪飲也愛賭博，與匹敵者豪快無比的戰鬥亦是她的摯愛，不過即使如此，對自己的職責還是會盡忠職守。";
CharInfo[3][9] = "原本身為挪威王國國王哈拉爾一世禁衛軍「挪威雄獅」的一員女將，是一名罕見的女性狂戰士，因為蒙受戰神奧丁的神力加持而具有特殊的狂戰體質，平時力量雖和一般戰士無異，但是在危急時能夠進入無我的狂暴狀態，突然湧出如熊又似狼般的勇猛力量，在戰場上大發神威。"
　　　　		+"<p>在一次掠奪英格蘭的戰爭當中，國王哈拉爾一世遭受英格蘭軍隊的伏擊，芙蕾雅因為護衛國王而奮勇戰死，卻因為其英勇而於死後被挑戰進入戰神奧丁的英靈殿「瓦爾哈拉」，並被選中為女武神，於人間尋找英勇的戰死者，為了在諸神的黃昏來臨之前，擴充神域的兵力以應付戰場所需。"
　　　　		+"<br>及後，英靈殿與《大法典》簽訂契約，並派出了芙蕾雅，協力進行魔法事件的調查。"
		　　　　+"<p>在挪威擁有一座伐木場和一片巨大的森林，偶爾也會拿著戰斧和寶劍於林中深處砍伐以發洩心中的暴戾和嗜血。";
