var ReplayIndex = {

	"DND-DoP": {
		TITLE: "【DND5E】恆水卞的奇妙冒險：鳳凰之死",
		ROUTE: "DND5e_DeathOfPhoenix/",
		ColorScheme: {
			"梨默"			: "#000000",
			"阿紅"			: "#ff0000",

			"GM"			: "#9900ff",
			"商隊大叔"		: "#9f82b1",
			"衛兵"			: "#9f82b1",
			"高個男性"		: "#9f82b1",
			"佐爾"			: "#9f82b1",
			"維特利普"		: "#9f82b1",
			"神秘的男聲"	: "#9f82b1",
			"雷蒙"			: "#9f82b1",
			"飛行長劍1"		: "#9f82b1",
			"飛行長劍2"		: "#9f82b1",
			"小隊長"		: "#9f82b1",
			"？？？"		: "#9f82b1",
			"衛兵傑克"		: "#9f82b1",
			"陰影"			: "#9f82b1",
			"NPC"			: "#9f82b1",
		//	"NPC"			: "#9f82b1",
		//	"NPC"			: "#9f82b1",
		},
		Docs: [
			{title:"2016.07.10-梨默入城", 	url:"DoP-0.txt"},
			{title:"2016.07.11-阿紅復出", 	url:"DoP-1.txt"},
			{title:"2016.07.12-初入朱紅大宅", 		url:"DoP-2.txt"},
			{title:"2016.07.14-第二日於朱紅大宅", 	url:"DoP-3.txt"},
		//	{title:"2016.07.25-第三日的調查", 		url:"DoP-4.txt"},
		//	{title:"2016.07.27-儲藏室的死鬥", 		url:"DoP-5.txt"},
		//	{title:"2016.07.31-尾聲", 				url:"DoP-6.txt"},
		]
	},

	"Magica-DH": {
		TITLE: "【魔道書大戰】魔偶之館",
		ROUTE: "Magica_DollsHouse/",
		ColorScheme: {
			"PL-02 普莉謝"	: "#e132da",
			"普莉謝"		: "#e132da",
			"槍姐"			: "#a88d2e",
			"治癒"			: "#806b23",
			"羽海野"		: "#176e9d", 
			"押當"			: "#735692",
			"伽美里"		: "#723026",
			"愛拉斐波里"	: "#2a158b",
			"穆妮姬"		: "#068d0e",
			"波瑟蒂"		: "#4a2e57",

			"土御門 嵐" 	: "#bf00ff",
		},
		Docs: [
		//	{title:"團務", url:"index.txt"},
			{title:"2015.04.06-試導入", 					url:"DH-0.txt"},
			{title:"2015.05.29-導入(上)",					url:"DH-1.txt"},
			{title:"2015.06.05-導入(下)&第一巡迴(上)", 		url:"DH-2.txt"},
			{title:"2015.06.12-第一巡迴(下)", 				url:"DH-3.txt"},
			{title:"2015.07.15-插曲(一)", 					url:"DH-4.txt"},
			{title:"2015.08.11-第二巡迴(上)", 				url:"DH-5.txt"},
			{title:"2015.08.17-第二巡迴(下)", 				url:"DH-6.txt"},
			{title:"2015.08.24-間章&插曲(二)", 				url:"DH-7.txt"},
			{title:"2015.09.09-第三巡迴(上)", 				url:"DH-8.txt"},
			{title:"2015.09.10-第三巡迴(下)", 				url:"DH-9.txt"},
			{title:"2015.10.04-高潮階段(上)", 				url:"DH-10.txt"},
			{title:"2015.10.07-高潮階段(下)", 				url:"DH-11.txt"},
			{title:"2015.10.07-後續", 						url:"DH-12.txt"},
		]
	},

	"Shinobi-TN": {
		TITLE: "【忍神】鐵鼠之檻",
		ROUTE: "Shinobi_TetsuNezumi/",
		ColorScheme: {
			"狸野隼汰"		: "#660000",
			"早川 鶴理"		: "#009900",
			"人形寺 芽理依"	: "#ff007f",
			"人形寺 芽龍" 	: "#660066",
			"罟夢 芯火" 		: "#003399",
			"鐵鼠居士" 		: "#666666",
		},
		Docs: [
			//{title:"團務", url:"index.txt"},
			{title:"2015.09.23-個別導入(上)", 					url:"TN-0.txt"},
			{title:"2015.09.28-個別導入(下)", 					url:"TN-1.txt"},
			{title:"2015.10.01-導入&第一巡迴(上)", 				url:"TN-2.txt"},
			{title:"2015.10.08-第一巡迴(中)", 					url:"TN-3.txt"},
			{title:"2015.10.14-第一巡迴(下)", 					url:"TN-4.txt"},
			{title:"2015.10.21-第二巡迴(上)", 					url:"TN-5.txt"},
			{title:"2015.10.28-第二巡迴(中)", 					url:"TN-6.txt"},
			{title:"2015.11.04-第二巡迴(下)", 					url:"TN-7.txt"},
			{title:"2015.11.13-第三巡迴(上)", 					url:"TN-8.txt"},
			{title:"2015.11.18-第三巡迴(中)", 					url:"TN-9.txt"},
			{title:"2015.11.20-第三巡迴(下)", 					url:"TN-10.txt"},
			{title:"2015.11.25-高潮階段(上)", 					url:"TN-11.txt"},
			{title:"2015.11.27-高潮階段(下)", 					url:"TN-12.txt"},
			{title:"2015.12.02-後續：芽理依&鶴理", 				url:"TN-13.txt"},
			{title:"2015.12.04-後續：隼汰&芽龍", 				url:"TN-14.txt"}
		]
	}

};